000100 IDENTIFICATION DIVISION.                                         
000200 PROGRAM-ID. OBSOLETE.                                            
000300 AUTHOR. SOMEBODY IMPORTANT                                       
000400        WITH A MULTILINE DESCRIPTION.                             
000500 INSTALLATION. SOME MAINFRAME SHOP.                               
000600 DATE-WRITTEN. APRIL 2021.                                        
000700 DATE-COMPILED. TODAY.                                            
000800 SECURITY. CONFIDENTIAL FREE TEXT                                 
000900        MORE FREE TEXT LINES.                                     
001000 ENVIRONMENT DIVISION.                                            
001100 DATA DIVISION.                                                   
001200 WORKING-STORAGE SECTION.                                         
001300 01 WS-X PIC 9 VALUE 0.                                           
001400 PROCEDURE DIVISION.                                              
001500 MAIN-PARA.                                                       
001600     STOP RUN.                                                    
