       01 OUTER-REC.                                                    
          05 OUTER-FLD PIC X(5).                                        
       COPY INNER.                                                      
