       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATA-SAMPLE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO 'INPUT.DAT'.
       DATA DIVISION.
       FILE SECTION.
       FD  INFILE.
       01  IN-RECORD.
           05 IN-KEY   PIC X(10).
           05 IN-DATA  PIC X(80).
       WORKING-STORAGE SECTION.
       01 WS-BUFFER.
           05 WS-NUMERIC PIC 9(10).
           05 WS-CHAR    REDEFINES WS-NUMERIC PIC X(10).
       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN INPUT INFILE.
           READ INFILE INTO WS-BUFFER.
           DISPLAY WS-CHAR.
           CLOSE INFILE.
           STOP RUN.

